test/perf/results/round1-ultra9-185h/batch_rtt0_c50.txt
==============================================================
Endpoint : http://127.0.0.1:20080/api/v1/filter/batch
RTT      : 0ms    Conns: 50   Threads: 16   Duration: 30s
Time     : 2026-05-13T21:35:08+08:00
==============================================================
Running 30s test @ http://127.0.0.1:20080/api/v1/filter/batch
  16 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.24ms   71.22ms 837.97ms   97.97%
    Req/Sec   164.16     41.88   760.00     88.05%
  Latency Distribution
     50%   20.64ms
     75%   28.60ms
     90%   33.71ms
     99%  475.12ms
  79137 requests in 30.87s, 379.62MB read
Requests/sec:   2563.20
Transfer/sec:     12.30MB